Tekla Open API Reference for Tekla Structures 2025
Contour.AddContourPoint Method
 Adds a new contour point to the contour. Do not add the same contour point twice.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void AddContourPoint(
	ContourPoint Point
)
Public Sub AddContourPoint (
	Point As ContourPoint
)
Parameters
Point
Type: Tekla.Structures.Model.ContourPoint
The contour point to add.
See Also
Reference
Contour Class
Tekla.Structures.Model Namespace